<template>
  <el-drawer v-model="modal" size="450px">
    <template #title>
      <strong style="color:black; font-size:1.4em;">О проекте</strong>
    </template>
    <div class="about">
      <p>Здесь представлены данные измерений вертикального профиля температуры атмосферы высотой до 1000 м, получаемые с
        помощью метеорологических температурных профилемеров МТР-5 производства НПО АТТЕХ.</p>

      <p>Исследования выполняются ИВМ СО РАН &ndash; обособленным подразделением ФИЦ КНЦ СО РАН.</p>

      <p>
        <u>
          <span>
            <strong>Используемое оборудование</strong>
          </span>
        </u>
      </p>

      <p class="m-0">В настоящее время доступны данные с двух профилемеров МТР-5:</p>

      <ul class="mt-0">
        <li>#1: Стационарный (ФИЦ КНЦ СО РАН)</li>
        <li>#2: Мобильный (АО "Красноярская ГЭС")</li>
      </ul>

      <p>Профилемер #2 может регистрировать данные в одной из нескольких точек мобильного мониторинга: #2A, #2B, #2C,
        #2D, &hellip; (см. карту точек мониторинга). Таким образом, выбор #2 означает любые данные мобильного
        профилемера, а выбор типа #2C &ndash; только те из них, которые были получены в конкретной точке мобильного
        мониторинга.</p>

      <table class="about-table" cellpadding="3" cellspacing="1" style="width:410px">
        <tbody>
          <tr>
            <td>&nbsp;</td>
            <td>
              <strong>Обозначение</strong>
            </td>
            <td>
              <strong>Место размещения</strong>
            </td>
          </tr>
          <tr>
            <td>#1</td>
            <td>Стационарный</td>
            <td>ул. Качинская, 56А</td>
          </tr>
          <tr>
            <td>#2</td>
            <td>Мобильный</td>
            <td>&nbsp;</td>
          </tr>
          <tr>
            <td>#2A</td>
            <td>ГЭС</td>
            <td>Территория Красноярской ГЭС</td>
          </tr>
          <tr>
            <td>#2B</td>
            <td>Посадный</td>
            <td>Территория о. Посадный</td>
          </tr>
        </tbody>
      </table>

      <p>Точка мобильного мониторинга #2B является &laquo;базовой&raquo; в настоящее время. В избранные моменты времени
        профилемер #2 снимается с &laquo;базовой&raquo; точки мониторинга, устанавливается на автомобиль и перемещается
        по нескольким другим точкам мобильного мониторинга.</p>

      <p>
        <strong>
          <u>
            <span>Описание интерфейса пользователя</span>
          </u>
        </strong>
      </p>

      <p>
        <u>Экран разделен на две части</u> &ndash; слева графики профиля температуры в зависимости от высоты (на
        заданный момент времени), справа &ndash; два окна с данными на выбранный период времени (термограммы, и проч.)
      </p>

      <p class="m-0">
        <u>Окна с данными</u> могут содержать следующую информацию:
      </p>

      <ul class="mt-0">
        <li>
          <strong>Термограммы</strong> &ndash; графики температуры от времени на разных высотах
        </li>
        <li>
          <strong>Температура атмосферы</strong> &ndash; тепловая карта: изменение температуры с высотой от времени
        </li>
        <li>
          <strong>Температурные инверсии</strong> &ndash; тепловая карта инверсий по высоте от времени
        </li>
        <li>
          <strong>Температурная разница</strong> &ndash; тепловая карта разницы температуры двух профилемеров с высотой
          от времени
        </li>
        <li>
          <strong>PM2.5 и ветер</strong> &ndash; данные по концентрации взвешенных частиц и скорости ветра с ближайшего
          поста экологического мониторинга
        </li>
      </ul>

      <p class="m-0">
        <u>Заголовки окон с данными</u> содержат указание на выбранный профилемер, например
      </p>

      <ul class="mt-0">
        <li>#1: Термограммы &ndash; данные профилемера #1,</li>
        <li>#2А: Температура атмосферы &ndash; данные профилемера #2A.</li>
      </ul>

      <p class="m-0">
        <u>Режим просмотра</u>
      </p>

      <ul class="mt-0">
        <li>
          <strong>Один профилемер</strong> &ndash; отображаются данные с одного профилемера. Из списка можно выбрать
          один из профилемеров, для которых имеются данные в заданный период времени.
        </li>
        <li>
          <strong>Два профилемера</strong> &ndash; отображение данных с двух профилемеров одновременно: в верхнем окне
          &ndash; данные стационарного профилемера #1, в нижнем окне &ndash; данные мобильного профилемера #2.
        </li>
      </ul>

      <p class="m-0">
        <u>Дополнительные настройки</u>
      </p>

      <ul class="mt-0">
        <li>
          <strong>Периоды работы профилемера #2</strong> &ndash; отображение на шкале времени подписей периодов работы
          мобильного профилемера #2.
        </li>
        <li>
          <strong>Сухая адиабата</strong> &ndash; отображение в окне "Профиль" адиабаты, характеризующей изменения
          состояния сухого или ненасыщенного влажного воздуха. Используется для оценки устойчивости атмосферы и анализа
          ситуаций, возникающих при рассеянии шлейфов дымовых выбросов.
        </li>
      </ul>

      <p class="m-0">
        <u>&laquo;Скрытые&raquo; возможности интерфейса</u>
      </p>

      <ul class="mt-0">
        <li>
          <strong>Масштабирование/сдвиг графиков</strong> &ndash; обеспечиваются средствами используемой графической
          open-source библиотеки Plotly.js. В правом верхнем углу выбранного мышью графика появляется коллекция активных
          пиктограмм, применяя которые можно выполнить настройку изображения. В зависимости от выбранного режима
          (Зум/Сдвиг) выделение участка графика мышью вызывает его масштабирование или смещение.
        </li>
        <li>
          <strong>Управление легендой термограммы/профиля</strong> &ndash; щелчком мыши по классу в легенде можно
          выключить/включить отображение одной или нескольких кривых на графике.
        </li>
        <li>
          <strong>Сохранить текущую конфигурацию</strong> &ndash; щелчком мыши по кнопке &laquo;Сохранить&raquo;
          (вверху, справа от выбора диапазона времени) в буфер обмена копируется гиперссылка на текущую конфигурацию
          (выбранный диапазон времени, настройки окон, и проч.).
        </li>
      </ul>
    </div>
  </el-drawer>
</template>

<script>
import { mapActions, mapGetters } from "vuex";
export default {
  methods: {
    ...mapActions(["UpdateAbout"]),
  },
  computed: {
    ...mapGetters(["about"]),
    modal: {
      get() {
        return this.about;
      },
      set(value) {
        this.UpdateAbout(value);
      },
    },
  },
};
</script>

<style>
.about .m-0 {
  margin: 0;
}

.about .mt-0 {
  margin-top: 0;
}

/* .about {
  text-align: justify;
} */

.about-table {
  align-self: center;
  border: solid 1px #999999;
  margin-bottom: 1em;
  margin-left: auto;
  margin-right: auto;
  border-collapse: collapse;
}

.about-table td {
  border-bottom: solid 1px #999999;
}
</style>